{
    "assistantId": "a32b0538-cd5a-48be-848b-23185c0d7388",
    "assistantOverrides": {
        "variableValues": {
            "candidate_name": "Aqueeluddin",
            "candidate_location": "Riyadh",
            "candidate_cv": "Aqueeluddin Khaja \nDevOps Engineer \n\nEmail: aqueeluddinkhaja@gmail.com | Mobile: +966-501941293 |Riyadh, Saudi \n\nLinkedIn: Aqueeluddin-Khaja \n\n \n\nCareer Summary: \n\nHighly skilled DevOps Engineer with over 12 years of combined experience in \n\nmanaging containerized infrastructure on AWS Cloud and on-premises VMware \n\nenvironments. Experienced in implementing CI/CD pipelines and Linux \n\nadministration with a strong focus on RHEL OS upgrading, configuration, and \n\ntroubleshooting.  \n\n \n\nCertifications: \n\n• Certified Kubernetes Administrator (LF-c7nfmmr87k) \n\n• VMware VCP-DCV (15388812-A474-D59DD47DDB03) \n\n• Dell EMC² EMCISA (ZYH1D68SG2FEC2Q3)  \n\n• Red Hat Certified Engineer (RHCE) (111-136-735) \n\n• Red Hat Certified System Administrator \n\n \n\nTechnical Skills: \n\nContainer Orchestration : Kubernetes, Docker \n\nCloud Platforms  : AWS \n\nCI/CD Tools   : Jenkins, GitHub Actions, ArgoCD \n\nConfig & IaC Tool  : Ansible, Terraform \n\nScripting   : Bash Scripting \n\nVirtualization  : VMware, Virtual Box, Vagrant \n\nLinux Administration : RHEL, CentOS, Ubuntu \n\nTools    : Git, EC2, ECR, ECS, EFS, EBS, S3, IAM,  \n\nVPC, CloudWatch, Prometheus, Grafana, OP5 \n\nEducation: \n\nEngineering in Electronics and Communications Engineering, from Jawaharlal \n\nNehru Technology University, Hyderabad – 2011. \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nmailto:aqueeluddinkhaja@gmail.com\nhttps://www.linkedin.com/in/aqueeluddin-khaja/\n\n\nProfessional Experience: \n\nProviding Consulting Services: \n\nESDC, Canada \n\nJune 2024 – Present \n\n \n\nKey Responsibilities:  \n\n \n\n• Provided expert consulting services to ESDC, focusing on upgrading and \n\noptimizing RHEL servers from RHEL 6/7 to RHEL 8.x hosted on VMware platforms. \n\n• Led RHEL system upgrade projects, ensuring minimal downtime and seamless \n\ntransitions by carefully planning and testing upgrade procedures. \n\n• Collaborated with clients to assess current RHEL system configurations, \n\nidentifying potential risks and recommending improvements in security and \n\nscalability. \n\n• Automated system maintenance tasks, including backup procedures, and \n\nserver monitoring using scripting tools like Bash. \n\n• Delivered training and documentation on server upgrades and \n\ntroubleshooting techniques for maintaining RHEL servers. \n\n \n\nDevOps Engineer  \n\nWipro Technologies LTD -IN \n\nMay 2016 – Sep 2024 \n\n \n\nEmphasize On-shore Team Collaboration: \n\n \n\n• Collaborated with Comcast’s on-shore team in the USA enhancing cross-\n\ncultural communication and project alignment. \n\n• Participated in multiple internal cross-functional trainings in the USA., gaining \n\nin-depth knowledge of Comcast’s RIO deployment. \n\n• Developed insights into USA business practices and team dynamics, \n\nstrengthening my abilities in teamwork, client management, or adaptability. \n\n \n\nKey Responsibilities:  \n\n \n\n• Experience in designing, building, and maintaining robust DevOps pipelines \n\nusing modern tools and technologies. \n\n• Managed and optimized Kubernetes clusters on AWS and On-premises, \n\nenabling efficient deployment of containerized applications with high \n\navailability. \n\n• Kubernetes, and Docker to manage microservices for the development of \n\ncontinuous integration and continuous delivery. \n\n• Hands-on experience with popular DevOps tools and technologies like \n\nKubernetes, Docker, Git, Jenkins, EKS, ECR, Terraform, Ansible, Helm, ArgoCD, \n\nGrafana, and Prometheus. \n\n\n\n• Hands-on experience with Continuous Integration / Continuous Delivery \n\n(CI/CD) tools such as Jenkins, GitHub Actions, and GitOps (ArgoCD). \n\n• Collaborate with development teams to establish best practices for \n\ncontinuous integration and continuous deployment (CI/CD). \n\n• Monitor and optimize the performance, scalability, and reliability of DevOps \n\npipelines and cloud deployments. \n\n• Contribute to the development and maintenance of infrastructure-as-code \n\n(IaC) templates and scripts. \n\n• Troubleshoot and resolve issues related to DevOps pipelines, cloud \n\ndeployments, and infrastructure. \n\n• Experience in scripting languages such as Bash. \n\n \n\nSystems Engineer \n\nOSI Digital – IN \n\nNov-2011 – May-2016 \n\n \n\nKey Responsibilities:  \n\n \n\n• Hands-on experience in the Administration of RedHat, Cent OS, and OEL \n\noperating systems in both physical and virtual environments. \n\n• Hands-on experience with VMware virtualization. \n\n• Hands-on experience in Shell Scripting. \n\n• Hands-on experience in the administration of storage technologies. \n\n• Hands-on experience managing/Administering AWS instances. \n\n• Having experience with Multipath configuration in Linux. \n\n• Troubleshooting printer-related issues and connectivity issues, Monitoring Print \n\nQueues. \n\n• Monitored System Activities like CPU, Memory, Disk, and Swap space usage \n\nto avoid performance issues. \n\n• Configuring Monitoring Agents and configuring servers with Monitoring Tool. \n\n• Hands-on experience in code push and build push activities in a Linux \n\nenvironment. \n\n• Updating Clients regularly and Managing Escalations/ Issues as per SLAs \n\ndefined. \n\n• Hands-on experience in applying operating system patches. \n\n• Hands-on experience in OS upgrade as per client requirements. \n \n\nPersonal Dossier:  \n\nDate of Birth  :  05 -09-1988 \n\nNationality  :  Indian \n\nIqama  : 2589200886 \n\nVisa Status  : Transferable \n\nVisa Profession :  Telecommunication Engineer \n\nVisa   :   United States of America B1/B2 \n\nCanadian Digital Nomads",
            "list_of_3_specific_questions": "1. Can you describe a project where you used Infrastructure as Code tools like Terraform and Ansible to design, build, or optimize a cloud or on-premises environment? What challenges did you encounter and how did you address them?\n\n([Pause for response])\n2. Could you walk us through your experience in developing and managing CI/CD pipelines using tools such as Jenkins or GitHub Actions, and how you integrated container technologies like Docker and Kubernetes into those pipelines?\n\n([Pause for response])\n3. How have you implemented scalable, secure multi-cloud or hybrid deployments, including self-healing and auto-scaling mechanisms, and what strategies have you used to ensure compliance and reliability in such environments?\n\n([Pause for response])\n",
            "job_title": "Senior Cloud Automation Engineer",
            "job_description": "Job Purpose\n\n\n\nWe are looking for a Cloud Automation Engineer to design, build, and optimize infrastructure automation solutions for cloud-based environments. The ideal candidate will have hands-on experience with Terraform, Ansible, CloudFormation, and expertise in setting up CI/CD pipelines. This role also involves leveraging VMware automation and the Aria stack to implement scalable and secure infrastructure solutions using Infrastructure as Code (IaC) practices.\n\n\n\nKey Responsibilities\n\n\n\nInfrastructure Automation & Orchestration\n\n * Develop and maintain scalable and reusable IaC templates using Terraform, Ansible, and CloudFormation.\n * Automate provisioning, configuration, and management of cloud infrastructure across public, private, and hybrid cloud environments.\n * Implement and manage VMware automation solutions, including the Aria stack.\n * Apply policy-as-code practices to enforce compliance and governance in automated deployments.\n\nCI/CD Pipeline Management\n\n * Design and manage CI/CD pipelines to automate infrastructure and application deployments.\n * Integrate automated testing and quality gates to ensure stability and performance.\n * Work closely with DevOps and development teams to streamline the software delivery lifecycle.\n\nCloud Platform Management\n\n * Deploy and optimize cloud infrastructure on AWS, Azure, and Google Cloud.\n * Support multi-cloud and hybrid cloud strategies using IaC tools.\n * Enable cloud-native architectures and manage containerized environments with Kubernetes and Docker.\n * Utilize VMware automation tools to enhance operational efficiency and enable self-service capabilities.\n\nMonitoring & Optimization\n\n * Monitor infrastructure performance and implement auto-scaling and self-healing mechanisms.\n * Identify and automate repetitive operational tasks to improve efficiency and reduce downtime.\n * Troubleshoot infrastructure issues to ensure high availability and disaster recovery readiness.\n\nCollaboration & Documentation\n\n * Work with development, operations, and security teams to align infrastructure automation with business objectives.\n * Maintain clear documentation of automation scripts, pipelines, and infrastructure architecture.\n * Provide mentorship and training to team members on IaC tools and best practices.\n\nRequired Skills & Qualifications\n\n\n\nEducation\n\n * Bachelor’s degree in Computer Science, Information Technology, or a related field (or equivalent experience).\n\nTechnical Expertise\n\n * Strong hands-on experience with Terraform, Ansible, and AWS CloudFormation for IaC implementation.\n * Expertise in CI/CD pipeline tools such as Jenkins, GitLab CI/CD, or GitHub Actions.\n * Proficiency in scripting languages like Python, Bash, or PowerShell.\n * Solid understanding of containerization (Docker) and orchestration (Kubernetes).\n * Experience with VMware automation platforms and the Aria stack for cloud and virtualization initiatives.\n * Familiarity with Git-based version control and GitOps workflows.\n\nCloud Platform Experience\n\n * Hands-on experience with at least one major cloud provider (OCI, AWS, Azure, or Google Cloud).\n * Familiarity with cloud-native services such as AWS Lambda, Azure Functions, or GCP Cloud Run.\n\nSoft Skills\n\n * Strong analytical and problem-solving skills with a proactive approach.\n * Excellent communication and collaboration abilities.\n * Ability to thrive in a fast-paced, team-oriented environment.\n\nExperience\n\n * 5+ years of experience in infrastructure automation, cloud engineering, or DevOps roles.\n * Proven experience in deploying and managing IaC at scale.\n * Banking industry experience is preferred.\n\nPreferred Qualifications\n\n * Familiarity with Agile methodologies and ITIL best practices.\n * Relevant certifications: * Terraform Associate (HashiCorp Certified)\n    * AWS, Azure, or Google Cloud Certifications\n    * Kubernetes (CKA/CKAD) Certifications",
            "job_location": "Dubai",
            "job_candidate_itris_id": "272444",
            "job_itris_id": "5262",
            "company_itris_id": "Ejada",
            "things_to_look_for_in_candidate": "The ideal candidate should have demonstrable hands-on experience in designing, building, and optimizing infrastructure automation using Infrastructure as Code (IaC) tools such as Terraform, Ansible, and AWS CloudFormation. They must be proficient in developing and managing robust CI/CD pipelines using tools like Jenkins, GitLab CI/CD, or GitHub Actions, with strong scripting skills in Python, Bash, or PowerShell. It is important to have a good grasp of containerization using Docker and orchestration via Kubernetes, as well as practical experience with VMware automation and the Aria stack in managing virtualized environments. The candidate should also be comfortable working in multi-cloud and hybrid cloud environments, ensuring scalable and secure deployments while implementing self-healing and auto-scaling mechanisms. Excellent communication and teamwork skills, coupled with a capacity to mentor and collaborate with cross-functional teams, are crucial in aligning technical solutions with business needs. Preferred candidates demonstrate a proactive approach to troubleshooting, compliance enforcement, and a background in agile and ITIL best practices, with banking industry experience being a notable plus.",
            "job_salary_range": "0-",
            "candidate_email": "aqueeluddinkhaja@gmail.com",
            "row_number_id": "3"
        }
    },
    "phoneNumberId": "aad281a0-214c-4419-a0b6-a7c2c01b889c",
    "customer": {
        "number": "+966501941293",
        "name": "Aqueeluddin"
    }
}